In [241]:
import tensorflow as tf
from tensorflow import keras
import pandas as pd
import numpy as np

In [242]:
target_arr = ["df['col1'].nunique()",
             "df.sort_values(by=['col1'],inplace =True)",
             "df.sort_values(by=['col1', 'col2'],inplace =True)",
             "df.sort_values(by=['col1', 'col2', 'col3'],inplace =True)",
             "df.drop(columns = 'col1',inplace = True)",
             "new_df=df.loc[:, ['col1','col2']]",
             "df['col1'].value_counts()",
             "<|{dataset}|chart|type=bar|x=col1|y=col2|height=100%|>",
             "<|{dataset}|chart|type=pie|values=col2|labels=col1|height=100%|>",
             "<|{dataset}|chart|mode=lines|x=col1|y=col2|>"]

In [243]:
df = pd.read_csv("sample_dataframe.csv")
df

   ID   Name  Salary  Age        Position    Address
0   1    Tom   50000   28         Analyst  Something
1   2  Harry   80000   32        Director  Something
2   3   Mary   20000   24          Intern   Anything
3   4    Jim  100000   40  Senior Manager    Nothing
4   5   Lily   95000   38         Manager  Something

In [244]:
cols = df.columns
cols

Index(['ID', 'Name', 'Salary', 'Age', 'Position', 'Address'], dtype='object')

In [245]:
sentence = "drop age column"
# print(sentence.split())
words = sentence.split()
cols_requested = []
for item in cols:
  # print(item)
  for word in words:
    if(item.upper() == word.upper()):
      cols_requested.append(item)

cols_requested

['Age']

In [246]:
general_sentence = sentence
for i in range(len(cols_requested)):
    general_sentence = general_sentence.replace(cols_requested[i], "col" + str(i+1))
general_sentence

'drop age column'

In [247]:
from transformers import AutoTokenizer

model_ckpt = "distilbert-base-uncased"
tokenizer = AutoTokenizer.from_pretrained(model_ckpt)

In [248]:
def tokenize(batch):
    return tokenizer(batch, padding=True, truncation=True)

In [249]:
print(tokenize(general_sentence))

{'input_ids': [101, 4530, 2287, 5930, 102], 'attention_mask': [1, 1, 1, 1, 1]}

In [250]:
test_sentence = [general_sentence]
test_sequence = tokenize(test_sentence).input_ids
test_sequence

[[101, 4530, 2287, 5930, 102]]

In [251]:
from tensorflow.keras.preprocessing.sequence import pad_sequences

max_length = 20

test_padded = pad_sequences(test_sequence, maxlen=max_length, padding='post', truncating='post')
test_padded

array([[ 101, 4530, 2287, 5930,  102,    0,    0,    0,    0,    0,    0,
           0,    0,    0,    0,    0,    0,    0,    0,    0]])

In [1]:
import torch

In [ ]:
# Save the model weights to a file
torch.save(model.state_dict(), 'pytorch_weights.pth')

In [ ]:
input_shape = (256, 256, 3)
keras_model = build_model(input_shape)

In [252]:
from tensorflow.keras.models import load_model
model = tf.keras.models.load_model('fyp.h5')

In [253]:
prediction = model.predict(test_padded)
prediction_int = np.argmax(prediction, axis=1)
prediction_int[0]

1/1 [==============================] - 0s 499ms/step

4

In [254]:
panda_query = target_arr[prediction_int[0]]
panda_query

"df.drop(columns = 'col1',inplace = True)"

In [255]:
for i in range(len(cols_requested)):
  panda_query = panda_query.replace("col" + str(i+1), cols_requested[i])
panda_query

"df.drop(columns = 'Age',inplace = True)"

In [256]:
exec(panda_query)
df

   ID   Name  Salary        Position    Address
0   1    Tom   50000         Analyst  Something
1   2  Harry   80000        Director  Something
2   3   Mary   20000          Intern   Anything
3   4    Jim  100000  Senior Manager    Nothing
4   5   Lily   95000         Manager  Something